Tekla.Structures.ModelInternal.CDelegateWrapper


Tekla.Structures.ModelInternal.CDelegateWrapper._instance


Tekla.Structures.ModelInternal.CDelegateWrapper._functionality


Tekla.Structures.ModelInternal.CDelegateWrapper.#ctor(Tekla.Structures.ModelInternal.ICDelegate,Tekla.Structures.Internal.WrapperFunctionalityBase)


Tekla.Structures.ModelInternal.CDelegateWrapper.ExportUIObjectSelect(Tekla.Structures.ModelInternal.dotUIModelObjectSelector_t@)


Tekla.Structures.ModelInternal.CDelegateWrapper.ExportUIObjectHighlight(Tekla.Structures.ModelInternal.dotUIModelObjectHighlighter_t@)


Tekla.Structures.ModelInternal.CDelegateWrapper.ExportUIObjectPick(Tekla.Structures.ModelInternal.dotUIPickerWrapper_t@)
DO NOT USE! For internal usage only!
pPicker:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportUIObjectsPick(Tekla.Structures.ModelInternal.dotUIPickerWrapper_t@)
DO NOT USE! For internal usage only!
pPicker:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportTaskObjectAttach(Tekla.Structures.ModelInternal.dotTaskObjectAttacher_t@)
DO NOT USE! For internal usage only!
pSelector:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreatePart(Tekla.Structures.ModelInternal.dotPart_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@)
DO NOT USE! For internal usage only!
pPart: The part to create.
contour: Contour points of the part.
Returns: 0 in the case of failure and 1 in the case of success

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateAssembly(Tekla.Structures.ModelInternal.dotAssembly_t@)
DO NOT USE! For internal usage only!
pAssembly: The assembly to create.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateLoftedPlate(Tekla.Structures.ModelInternal.dotPart_t@,System.Collections.Generic.List{System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotPolycurvePoint_t}}@,System.Int32)
DO NOT USE! For internal usage only!
pPart:
baseCurves:
FaceType:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportValidateLoftedPlate(System.Collections.Generic.List{System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotPolycurvePoint_t}}@)
DO NOT USE! For internal usage only!
baseCurves:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateBentPlateByParts(System.Int32,System.Int32,System.Int32)
DO NOT USE! For internal usage only!
part1Id:
part2Id:
bendShape:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateBentPlateByPartsAndRadius(System.Int32,System.Int32,System.Double)
DO NOT USE! For internal usage only!
part1Id:
part2Id:
radius:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateConicalBentPlateByPartsAndRadiusAperture(System.Int32,System.Int32,System.Double,System.Double)
DO NOT USE! For internal usage only!
part1Id:
part2Id:
radius:
halfAperture:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateConicalBentPlateByPartsAndTwoRadiuses(System.Int32,System.Int32,System.Double,System.Double)
DO NOT USE! For internal usage only!
part1Id:
part2Id:
firstRadius:
secondRadius:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateBentPlateByFaces(System.Int32,System.Int32,Tekla.Structures.ModelInternal.dotPolygon_t@,Tekla.Structures.ModelInternal.dotPolygon_t@,System.Int32)
DO NOT USE! For internal usage only!
part1Id:
part2Id:
face1:
face2:
bendShape:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateBentPlateByFacesAndRadius(System.Int32,System.Int32,Tekla.Structures.ModelInternal.dotPolygon_t@,Tekla.Structures.ModelInternal.dotPolygon_t@,System.Double)
DO NOT USE! For internal usage only!
part1Id:
part2Id:
face1:
face2:
radius:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateConicalBentPlateByFacesAndRadiusAperture(System.Int32,System.Int32,Tekla.Structures.ModelInternal.dotPolygon_t@,Tekla.Structures.ModelInternal.dotPolygon_t@,System.Double,System.Double)
DO NOT USE! For internal usage only!
part1Id:
part2Id:
face1:
face2:
largestRadius:
halfAperture:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportConnectGeometryTrees(Tekla.Structures.ModelInternal.dotClientId_t@,System.Int32)
DO NOT USE! For internal usage only!
clientId:
bendShape:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportConnectGeometryTreesWithRadius(System.Double,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
radius:
clientId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportConnectGeometryTreesWithRadiusAperture(System.Double,System.Double,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
largestRadius:
halfAperture:
clientId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportConnectGeometryTreesByPoints(Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.ModelInternal.dotClientId_t@,System.Int32)
DO NOT USE! For internal usage only!
side1Start:
side1End:
side2Start:
side2End:
clientId:
bendShape:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportConnectGeometryTreesByPointsWithRadius(System.Double,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
radius:
side1Start:
side1End:
side2Start:
side2End:
clientId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportConnectGeometryTreesByPointsWithRadiusAperture(System.Double,System.Double,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
largestRadius:
halfAperture:
side1Start:
side1End:
side2Start:
side2End:
clientId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyGeometryTreeCylindricalNodeRadius(System.Int32,System.Double,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
geometryNodeId:
radius:
clientId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyConicalNodeRadiuses(System.Int32,System.Double,System.Double,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
geometryNodeId:
newMaxRadius:
newMinRadius:
clientId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyGeometryTreeConicalNodeByScale(System.Int32,System.Double,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
geometryNodeId:
scale:
clientId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyGeometryTreeCylindricalNodeCurveType(System.Int32,System.Int32,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
geometryNodeId:
newCurveType:
clientId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyGeometryTreePolygonNode(System.Int32,Tekla.Structures.ModelInternal.dotContour_t@,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
geometryNodeId:
contour:
clientId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyBendSurfaceNode(System.Int32,System.Int32,System.Int32,Tekla.Structures.ModelInternal.dotContour_t@,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
geometryNodeId:
firstBoundaryPoints:
secondBoundaryPoints:
surfacePoints:
clientId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSetNewBentPlateRoot(System.Int32,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
geometryNodeId:
clientId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyBendAngle(System.Double,System.Int32,System.Int32,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
angle:
curvedNodeId:
movingNodeId:
clientId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExplodeBentPlate(System.Int32)
DO NOT USE! For internal usage only!
partId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportExtractBentPlateFromComponent(System.Int32)
DO NOT USE! For internal usage only!
partId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetBentPlateMinimumRadius(System.Int32)
DO NOT USE! For internal usage only!
partId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetBentPlateMaximumRadiuses(System.Int32,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
geometryNodeId:
clientId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetSpiralBeamEndPoint(System.Double,System.Double,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotVector_t@,Tekla.Structures.Internal.dotPoint_t@)
DO NOT USE! For internal usage only!
RotationAngle:
TotalRise:
pStartPoint:
pCenterPoint:
pRotationAxisDirection:
pEndPoint:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCompareObjects(System.Int32,System.Int32)
DO NOT USE! For internal usage only!
ObjectId:
ObjectToCompareId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateBoltGroup(System.Double,System.Double,Tekla.Structures.ModelInternal.dotBoltGroup_t@,System.Collections.Generic.List{System.Double}@,System.Collections.Generic.List{System.Double}@)
DO NOT USE! For internal usage only!
NumberOfBolts:
Diameter:
pBoltGroup:
BoltDistX:
BoltDistY:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateSplitBoltGroup(System.Double,System.Double,Tekla.Structures.ModelInternal.dotBoltGroup_t@,System.Collections.Generic.List{System.Double}@,System.Collections.Generic.List{System.Double}@)
DO NOT USE! For internal usage only!
NumberOfBolts:
Diameter:
pBoltGroup:
BoltDistX:
BoltDistY:
Returns: True on succes

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateBooleanPart(Tekla.Structures.ModelInternal.dotBooleanPart_t@)
DO NOT USE! For internal usage only!
pBooleanPart:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateFittingOrCutPlane(Tekla.Structures.ModelInternal.dotFittingOrCutPlane_t@)
DO NOT USE! For internal usage only!
pFittingOrCutPlane:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateEdgeChamfer(Tekla.Structures.ModelInternal.dotEdgeChamfer_t@)
DO NOT USE! For internal usage only!
pEdgeChamfer:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateSurfaceTreatment(Tekla.Structures.ModelInternal.dotSurfaceTreatment_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@)
DO NOT USE! For internal usage only!
pTreatment:
pContour:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateWeld(Tekla.Structures.ModelInternal.dotWeld_t@)
DO NOT USE! For internal usage only!
pWeld:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateSingleRebar(Tekla.Structures.ModelInternal.dotSingleRebar_t@)
DO NOT USE! For internal usage only!
pSingleRebar:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateRebarGroup(Tekla.Structures.ModelInternal.dotRebarGroup_t@)
DO NOT USE! For internal usage only!
pRebarGroup:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateRebarMesh(Tekla.Structures.ModelInternal.dotRebarMesh_t@)
DO NOT USE! For internal usage only!
pRebarMesh:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateRebarStrand(Tekla.Structures.ModelInternal.dotRebarStrand_t@)
DO NOT USE! For internal usage only!
pRebarStrand:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateRebarSplice(Tekla.Structures.ModelInternal.dotRebarSplice_t@)
DO NOT USE! For internal usage only!
pRebarSplice:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateControlPlane(Tekla.Structures.ModelInternal.dotControlObject_t@)
DO NOT USE! For internal usage only!
pControlObject:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateControlPolycurve(Tekla.Structures.ModelInternal.dotControlObject_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotPolycurvePoint_t}@)
DO NOT USE! For internal usage only!
pControlObject:
polycurvePoints:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateControlSpline(Tekla.Structures.ModelInternal.dotControlObject_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@)
DO NOT USE! For internal usage only!
pControlObject:
imagePoints:
slopes:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateGridPlane(Tekla.Structures.ModelInternal.dotGridPlane_t@)
DO NOT USE! For internal usage only!
pGridPlane:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateGrid(Tekla.Structures.ModelInternal.dotGrid_t@)
DO NOT USE! For internal usage only!
pGrid:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateReferenceModel(Tekla.Structures.ModelInternal.dotReferenceModel_t@)
DO NOT USE! For internal usage only!
pReferenceModel:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateReferenceModelObjectAttributeEnumerator(Tekla.Structures.ModelInternal.dotReferenceModelObjectAttributeEnumerator_t@)
DO NOT USE! For internal usage only!
pEnumerator:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateReferenceModelObjectAttribute(Tekla.Structures.ModelInternal.dotReferenceModelObjectAttribute_t@)
DO NOT USE! For internal usage only!
pRMOAttribute:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateTask(Tekla.Structures.ModelInternal.dotTask_t@)
DO NOT USE! For internal usage only!
pTask:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateTaskDependency(Tekla.Structures.ModelInternal.dotTaskDependency_t@)
DO NOT USE! For internal usage only!
pTaskDependency:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateTaskWorktype(Tekla.Structures.ModelInternal.dotTaskWorktype_t@)
DO NOT USE! For internal usage only!
pTaskWorktype:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateLoad(Tekla.Structures.ModelInternal.dotLoadCommonAttributes_t@,Tekla.Structures.ModelInternal.dotLoadClassAttributes_t@)
DO NOT USE! For internal usage only!
pLoadCommonAttributes:
pLoadClassAttributes:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateLoadGroup(Tekla.Structures.ModelInternal.dotLoadGroup_t@)
DO NOT USE! For internal usage only!
pLoadGroup:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateComponent(Tekla.Structures.ModelInternal.dotBaseComponent_t@)
DO NOT USE! For internal usage only!
pBaseComponent:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportDisplayComponentHelp(Tekla.Structures.ModelInternal.dotBaseComponent_t@)
DO NOT USE! For internal usage only!
pBaseComponent:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportDisplayAutoDefaultSettings(Tekla.Structures.ModelInternal.dotBaseComponent_t@)
DO NOT USE! For internal usage only!
pBaseComponent:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportStartCustomComponentCreation(System.String)
DO NOT USE! For internal usage only!
ComponentName:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportStartPluginCreation(System.String)
DO NOT USE! For internal usage only!
ComponentName:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportComponentGetAttributeFileExtension(Tekla.Structures.ModelInternal.dotBaseComponent_t@,System.String@)
DO NOT USE! For internal usage only!
pBaseComponent: The object type.
fileExtension: The file extension.
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportComponentSaveAppliedAttributes(Tekla.Structures.ModelInternal.dotBaseComponent_t@,System.String)
DO NOT USE! For internal usage only!
pBaseComponent: The object type.
fileName: The file name.
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportComponentLoadAndSaveToAppliedAttributes(Tekla.Structures.ModelInternal.dotBaseComponent_t@,System.String)
DO NOT USE! For internal usage only!
pBaseComponent: The object type.
fileName: The file name.
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportComponentGetAppliedAttributes(Tekla.Structures.ModelInternal.dotBaseComponent_t@,System.Collections.Generic.List{System.Object}@,System.Collections.Generic.List{System.Object}@,System.Boolean)
DO NOT USE! For internal usage only!
pBaseComponent: The object type.
pNames: The applied attribute names.
pValues: The applied attribute values.
ignoreDefaultValues: Fetch also attributes with default attribute values.
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportComponentSetAppliedAttributes(Tekla.Structures.ModelInternal.dotBaseComponent_t@,System.Collections.Generic.List{System.Object}@,System.Collections.Generic.List{System.Object}@,System.Boolean)
DO NOT USE! For internal usage only!
pBaseComponent: The object type.
pNames: The applied attribute names.
pValues: The applied attribute values.
addNewAttributes: Are new attributes registered to internal component data storage.
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportComponentDeleteAttributes(Tekla.Structures.ModelInternal.dotBaseComponent_t@,System.Collections.Generic.List{System.String}@)
DO NOT USE! For internal usage only!
pBaseComponent: The object type.
pNames: The applied attribute names.
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreatePourBreak(Tekla.Structures.ModelInternal.dotPolymeshObject_t@)
DO NOT USE! For internal usage only!
pPourBreak:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSplitPart(System.Int32,Tekla.Structures.ModelInternal.dotPolymeshObject_t@)
DO NOT USE! For internal usage only!
PartId: ///
pSplit:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetFatherComponent(System.Int32,System.Int32@)
DO NOT USE! For internal usage only!
ObjectId:
FatherComponentId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetPolybeamCoordinateSystem(System.Int32,System.Int32,System.Int32,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@)
DO NOT USE! For internal usage only!
Id:
SubId:
Chamfered:
pX:
pY:
pZ:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCalculateContourPolygon(System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@,System.Collections.Generic.List{Tekla.Structures.Internal.dotPoint_t}@)
DO NOT USE! For internal usage only.
contour: The contour.
polygon: The polygon.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetPartLine(Tekla.Structures.ModelInternal.dotPartLine_t@)
DO NOT USE! For internal usage only!
pPartLine:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectPartWithGeometryTree(Tekla.Structures.ModelInternal.dotPart_t@)


Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectPart(Tekla.Structures.ModelInternal.dotPart_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@)
DO NOT USE! For internal usage only!
pPart: The part to select.
contour: Contour points of the part.
Returns: 0 in the case of failure and 1 in the case of success

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectLoftedPlate(Tekla.Structures.ModelInternal.dotPart_t@,System.Collections.Generic.List{System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotPolycurvePoint_t}}@,System.Int32@)
DO NOT USE! For internal usage only!
pPart:
baseCurves:
FaceType:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportFormatProfile(Tekla.Structures.ModelInternal.dotProfile_t@)
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportParseProfile(Tekla.Structures.ModelInternal.dotProfile_t@)
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectBoltGroup(System.Double@,System.Double@,Tekla.Structures.ModelInternal.dotBoltGroup_t@,System.Collections.Generic.List{System.Double}@,System.Collections.Generic.List{System.Double}@,System.Collections.ArrayList@)
DO NOT USE! For internal usage only!
pNumberOfBolts:
pDiameter:
pBoltGroup:
pBoltDistX:
pBoltDistY:
pBoltPositions:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetBoltedPartsHoleElevations(System.Int32,System.Collections.Generic.Dictionary{System.Int32,System.Tuple{System.Double,System.Double}})
DO NOT USE! For internal usage only!
boltId: The bolt identifier.
holeElevations: The hole elevations.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectBooleanPart(Tekla.Structures.ModelInternal.dotBooleanPart_t@)
DO NOT USE! For internal usage only!
pBooleanPart:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectFittingOrCutPlane(Tekla.Structures.ModelInternal.dotFittingOrCutPlane_t@)
DO NOT USE! For internal usage only!
pFittingOrCutPlane:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectEdgeChamfer(Tekla.Structures.ModelInternal.dotEdgeChamfer_t@)
DO NOT USE! For internal usage only!
pEdgeChamfer:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectSurfaceTreatment(Tekla.Structures.ModelInternal.dotSurfaceTreatment_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@)
DO NOT USE! For internal usage only!
pTreatment:
pContour:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectWeld(Tekla.Structures.ModelInternal.dotWeld_t@)
DO NOT USE! For internal usage only!
pWeld:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetWeldGeometry(Tekla.Structures.ModelInternal.dotWeldGeometry_t@)
DO NOT USE! For internal usage only!
pWeldGeometry:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectSingleRebar(Tekla.Structures.ModelInternal.dotSingleRebar_t@)
DO NOT USE! For internal usage only!
pSingleRebar:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectRebarGroup(Tekla.Structures.ModelInternal.dotRebarGroup_t@)
DO NOT USE! For internal usage only!
pRebarGroup:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectRebarBars(Tekla.Structures.ModelInternal.dotWire_t@)
DO NOT USE! For internal usage only!
pWire:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetRebarComplexGeometries(Tekla.Structures.ModelInternal.dotRebarComplexGeometry_t@,System.Collections.Generic.List{System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotPolycurvePoint_t}}@)


Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetRebarPluginData(Tekla.Structures.ModelInternal.dotRebarPluginData_t@,System.Collections.Generic.IList{System.Double}@,System.Collections.Generic.IList{System.Double}@,System.Collections.Generic.IList{System.Double}@)
DO NOT USE! For internal usage only!
data:
bendingRadii:
bendingAngles:
legLengths:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetVirtualBarIdentifiersByGuid(Tekla.Structures.Internal.dotIdentifier_t@,System.Collections.Generic.IList{System.Int32}@)
DO NOT USE! For internal usage only!
inputId:
outputIds:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectRebarMesh(Tekla.Structures.ModelInternal.dotRebarMesh_t@)
DO NOT USE! For internal usage only!
pRebarMesh:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectRebarStrand(Tekla.Structures.ModelInternal.dotRebarStrand_t@)
DO NOT USE! For internal usage only!
pRebarStrand:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectRebarSplice(Tekla.Structures.ModelInternal.dotRebarSplice_t@)
DO NOT USE! For internal usage only!
pRebarSplice:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectControlPlane(Tekla.Structures.ModelInternal.dotControlObject_t@)
DO NOT USE! For internal usage only!
pControlObject:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectControlPolycurve(Tekla.Structures.ModelInternal.dotControlObject_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotPolycurvePoint_t}@)
DO NOT USE! For internal usage only!
pControlObject:
polycurvePoints:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectControlSpline(Tekla.Structures.ModelInternal.dotControlObject_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@)
DO NOT USE! For internal usage only!
pControlObject:
imagePoints:
slopes:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectGridPlane(Tekla.Structures.ModelInternal.dotGridPlane_t@)
DO NOT USE! For internal usage only!
pGridPlane:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectGrid(Tekla.Structures.ModelInternal.dotGrid_t@)
DO NOT USE! For internal usage only!
pGrid:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectReferenceModel(Tekla.Structures.ModelInternal.dotReferenceModel_t@)
DO NOT USE! For internal usage only!
pReferenceModel:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectReferenceModelObject(Tekla.Structures.ModelInternal.dotReferenceModelObject_t@)
DO NOT USE! For internal usage only!
pReferenceModelObject:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectTask(Tekla.Structures.ModelInternal.dotTask_t@)
DO NOT USE! For internal usage only!
pTask:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectTaskDependency(Tekla.Structures.ModelInternal.dotTaskDependency_t@)
DO NOT USE! For internal usage only!
pTaskDependency:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectTaskWorktype(Tekla.Structures.ModelInternal.dotTaskWorktype_t@)
DO NOT USE! For internal usage only!
pTaskWorktype:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectLoad(Tekla.Structures.ModelInternal.dotLoadCommonAttributes_t@,Tekla.Structures.ModelInternal.dotLoadClassAttributes_t@)
DO NOT USE! For internal usage only!
pLoadCommonAttributes:
pLoadClassAttributes:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectLoadGroup(Tekla.Structures.ModelInternal.dotLoadGroup_t@)
DO NOT USE! For internal usage only!
pLoadGroup:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectAssembly(Tekla.Structures.ModelInternal.dotAssembly_t@)
DO NOT USE! For internal usage only!
pAssembly:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectComponent(Tekla.Structures.ModelInternal.dotBaseComponent_t@)
DO NOT USE! For internal usage only!
pBaseComponent:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectPourObject(Tekla.Structures.ModelInternal.dotPourObject_t@)
DO NOT USE! For internal usage only!
pPourObject:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectPourUnit(Tekla.Structures.ModelInternal.dotPourUnit_t@)
DO NOT USE! For internal usage only!
pPourUnit:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectPourBreak(Tekla.Structures.ModelInternal.dotPolymeshObject_t@)
DO NOT USE! For internal usage only!
pPourBreak:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyPourBreak(Tekla.Structures.ModelInternal.dotPolymeshObject_t@)
DO NOT USE! For internal usage only!
pPourBreak:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyPartWithGeometryTree(Tekla.Structures.ModelInternal.dotPart_t@)
DO NOT USE! For internal usage only!
pPart: The bent plate to modify
Returns: 0 in the case of failure and 1 in the case of success

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyPart(Tekla.Structures.ModelInternal.dotPart_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@)
DO NOT USE! For internal usage only!
pPart: The part to modify
contour: Contour points of the part.
Returns: 0 in the case of failure and 1 in the case of success

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyLoftedPlate(Tekla.Structures.ModelInternal.dotPart_t@,System.Collections.Generic.List{System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotPolycurvePoint_t}}@,System.Int32)
DO NOT USE! For internal usage only!
pPart:
baseCurves:
FaceType:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyBoltGroup(System.Double,System.Double,Tekla.Structures.ModelInternal.dotBoltGroup_t@,System.Collections.Generic.List{System.Double}@,System.Collections.Generic.List{System.Double}@)
DO NOT USE! For internal usage only!
NumberOfBolts:
Diameter:
pBoltGroup:
pBoltDistX:
pBoltDistY:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyBooleanPart(Tekla.Structures.ModelInternal.dotBooleanPart_t@)
DO NOT USE! For internal usage only!
pBooleanPart:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyFittingOrCutPlane(Tekla.Structures.ModelInternal.dotFittingOrCutPlane_t@)
DO NOT USE! For internal usage only!
pFittingOrCutPlane:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyEdgeChamfer(Tekla.Structures.ModelInternal.dotEdgeChamfer_t@)
DO NOT USE! For internal usage only!
pEdgeChamfer:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifySurfaceTreatment(Tekla.Structures.ModelInternal.dotSurfaceTreatment_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@)
DO NOT USE! For internal usage only!
pTreatment:
pContour:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyWeld(Tekla.Structures.ModelInternal.dotWeld_t@)
DO NOT USE! For internal usage only!
pWeld:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifySingleRebar(Tekla.Structures.ModelInternal.dotSingleRebar_t@)
DO NOT USE! For internal usage only!
pSingleRebar:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyRebarGroup(Tekla.Structures.ModelInternal.dotRebarGroup_t@)
DO NOT USE! For internal usage only!
pRebarGroup:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyRebarMesh(Tekla.Structures.ModelInternal.dotRebarMesh_t@)
DO NOT USE! For internal usage only!
pRebarMesh:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyRebarStrand(Tekla.Structures.ModelInternal.dotRebarStrand_t@)
DO NOT USE! For internal usage only!
pRebarStrand:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyRebarSplice(Tekla.Structures.ModelInternal.dotRebarSplice_t@)
DO NOT USE! For internal usage only!
pRebarSplice:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyControlPlane(Tekla.Structures.ModelInternal.dotControlObject_t@)
DO NOT USE! For internal usage only!
pControlObject:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyControlPolycurve(Tekla.Structures.ModelInternal.dotControlObject_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotPolycurvePoint_t}@)
DO NOT USE! For internal usage only!
pControlObject:
polycurvePoints:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyControlSpline(Tekla.Structures.ModelInternal.dotControlObject_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@)
DO NOT USE! For internal usage only!
pControlObject:
imagePoints:
slopes:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyGridPlane(Tekla.Structures.ModelInternal.dotGridPlane_t@)
DO NOT USE! For internal usage only!
pGridPlane:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyGrid(Tekla.Structures.ModelInternal.dotGrid_t@)
DO NOT USE! For internal usage only!
pGrid:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyReferenceModel(Tekla.Structures.ModelInternal.dotReferenceModel_t@)
DO NOT USE! For internal usage only!
pReferenceModel:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyTask(Tekla.Structures.ModelInternal.dotTask_t@)
DO NOT USE! For internal usage only!
pTask:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyTaskDependency(Tekla.Structures.ModelInternal.dotTaskDependency_t@)
DO NOT USE! For internal usage only!
pTaskDependency:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyTaskWorktype(Tekla.Structures.ModelInternal.dotTaskWorktype_t@)
DO NOT USE! For internal usage only!
pTaskWorktype:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyLoad(Tekla.Structures.ModelInternal.dotLoadCommonAttributes_t@,Tekla.Structures.ModelInternal.dotLoadClassAttributes_t@)
DO NOT USE! For internal usage only!
pLoadCommonAttributes:
pLoadClassAttributes:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyLoadGroup(Tekla.Structures.ModelInternal.dotLoadGroup_t@)
DO NOT USE! For internal usage only!
pLoadGroup:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyAssembly(Tekla.Structures.ModelInternal.dotAssembly_t@)
DO NOT USE! For internal usage only!
pAssembly:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyComponent(Tekla.Structures.ModelInternal.dotBaseComponent_t@)
DO NOT USE! For internal usage only!
pBaseComponent:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyPourObject(Tekla.Structures.ModelInternal.dotPourObject_t@)
DO NOT USE! For internal usage only!
pPourObject:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyPourUnit(Tekla.Structures.ModelInternal.dotPourUnit_t@)
DO NOT USE! For internal usage only!
pPourUnit:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportRefreshReferenceFile(Tekla.Structures.ModelInternal.dotReferenceModel_t@)
DO NOT USE! For internal usage only!
pReferenceModel:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetReferenceModelRevisionIds(Tekla.Structures.ModelInternal.dotReferenceModel_t@,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
pReferenceModel:
ClientId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectReferenceModelRevision(System.Int32,System.Int32,Tekla.Structures.ModelInternal.dotReferenceModelRevision_t@)
DO NOT USE! For internal usage only!
modelId:
revisionId:
pRevision:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportRemoveReferenceModelRevision(System.Int32,System.Int32)
DO NOT USE! For internal usage only!
modelId:
revisionId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSetAsCurrentRevision(System.Int32,System.Int32)
DO NOT USE! For internal usage only!
modelId:
revisionId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetBasePoints(Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
ClientId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectBasePoint(System.String,Tekla.Structures.ModelInternal.dotBasePointData_t@)
DO NOT USE! For internal usage only!
guid:
pBasePoint:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateBasePoint(Tekla.Structures.ModelInternal.dotBasePointData_t@)
DO NOT USE! For internal usage only!
pBasePoint:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyBasePoint(Tekla.Structures.ModelInternal.dotBasePointData_t@)
DO NOT USE! For internal usage only!
pBasePoint:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportDeleteBasePoint(Tekla.Structures.ModelInternal.dotBasePointData_t@)
DO NOT USE! For internal usage only!
pBasePoint:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportConvertToBasePoint(System.String,Tekla.Structures.Internal.dotPoint_t@)
DO NOT USE! For internal usage only!
basePointGuid:
pPoint:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportConvertFromBasePoint(System.String,Tekla.Structures.Internal.dotPoint_t@)
DO NOT USE! For internal usage only!
basePointGuid:
pPoint:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSetAsCurrentBasePoint(System.String,System.Int32)
DO NOT USE! For internal usage only!
basePointGuid:
value:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportAttachPointCloud(Tekla.Structures.ModelInternal.dotPointCloud_t@)
DO NOT USE! For internal usage only!
pPointCloud:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportDetachPointCloud(System.String)
DO NOT USE! For internal usage only!
pointCloudGuid:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetPointClouds(Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
ClientId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetPointCloudVisibleInViews(Tekla.Structures.ModelInternal.dotClientId_t@,System.String)
DO NOT USE! For internal usage only!
ClientId:
pointCloudGuid:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectPointCloud(System.String,Tekla.Structures.ModelInternal.dotPointCloud_t@)
DO NOT USE! For internal usage only!
pointCloudGuid:
pPointCloud:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSetPointCloudVisibility(System.String,System.Int32,System.Int32)
DO NOT USE! For internal usage only!
pointCloudGuid:
viewObjectId:
visible:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportDaoFindObject(System.Int32,System.String,System.String,System.Int32)
DO NOT USE! For internal usage only!
parentId:
type:
name:
position:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCleanDrawingFiles(System.Boolean,System.String)
DO NOT USE! For internal usage only!
Silent:
BackupPath:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetFatherReferenceAssemblyId(System.Int32)
DO NOT USE! For internal usage only!
referenceObjectId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportHierarchicDefinition(Tekla.Structures.ModelInternal.dotHierarchicDefinition_t@)
DO NOT USE! For internal usage only!
pHierarchicDefinition:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportHierarchicObject(Tekla.Structures.ModelInternal.dotHierarchicObject_t@)
DO NOT USE! For internal usage only!
pHierarchicObject:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportHierarchicObjectChildrenOperation(Tekla.Structures.ModelInternal.dotHierarchicList_t@)
DO NOT USE! For internal usage only!
pHierarchicList:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetBuildingHierarchyChildObjectGuids(Tekla.Structures.ModelInternal.dotBuildingHierarchyOperation_t@)
DO NOT USE! For internal usage only!
Operation:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportBuildingHierarchyOperation(Tekla.Structures.ModelInternal.dotBuildingHierarchyOperation_t@)
DO NOT USE! For internal usage only!
Operation:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportBuildingHierarchySiteOperation(Tekla.Structures.ModelInternal.dotBuildingHierarchySiteOperation_t@)
DO NOT USE! For internal usage only!
Site:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportBuildingHierarchyBuildingOperation(Tekla.Structures.ModelInternal.dotBuildingHierarchyBuildingOperation_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@)
DO NOT USE! For internal usage only!
Building:
contour:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportBuildingHierarchyStoreyOperation(Tekla.Structures.ModelInternal.dotBuildingHierarchyStoreyOperation_t@)
DO NOT USE! For internal usage only!
StoreyOperation:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportBuildingHierarchyOverrideOperation(Tekla.Structures.ModelInternal.dotBuildingHierarchyOverrideOperation_t@)
DO NOT USE! For internal usage only!
OverrideOperation:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportBuildingHierarchyGetObjectsOperation(Tekla.Structures.ModelInternal.dotBuildingHierarchyGetObjectsOperation_t@)
DO NOT USE! For internal usage only!
GetObjectsOperation:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportBuildingSpacesOperation(Tekla.Structures.ModelInternal.dotBuildingSpacesSpaceOperation_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@)


Tekla.Structures.ModelInternal.CDelegateWrapper.ExportDeleteObject(Tekla.Structures.Internal.dotIdentifier_t@)
DO NOT USE! For internal usage only!
pIdentifier:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportEnumerateObjects(Tekla.Structures.ModelInternal.dotEnumerator_t@)
DO NOT USE! For internal usage only!
pEnumerator:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetSolid(Tekla.Structures.ModelInternal.dotSolid_t@)
DO NOT USE! For internal usage only!
pSolid:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetIntersectionSolid(Tekla.Structures.ModelInternal.dotIntersectionSolid_t@)
DO NOT USE! For internal usage only!
pSolid:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetIntersectionPoints(Tekla.Structures.ModelInternal.dotIntersectionPoints_t@)
DO NOT USE! For internal usage only!
pIntersectionPoints:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCommitChanges(Tekla.Structures.ModelInternal.dotModelCommit_t@)
DO NOT USE! For internal usage only!
pModelCommit:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportRunOrStopClashCheck(System.Boolean)
DO NOT USE! For internal usage only!
RunningClashCheck:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportRunClashCheckWithOptions(System.Int32,System.Int32,System.Int32,System.Double,System.Int32)
DO NOT USE! For internal usage only!
betweenReferenceModels:
betweenReferenceModelsAndComponents:
objectsInsideReferenceModels:
minDistance:
betweenParts:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetIntersectionBoundingBoxes(Tekla.Structures.Internal.dotIdentifier_t@,Tekla.Structures.Internal.dotIdentifier_t@,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
Identifier1:
Identifier2:
ClientId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetDetectedClash(Tekla.Structures.ModelInternal.dotClash_t@)
DO NOT USE! For internal usage only!
pClash:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetNumberOfClashes(System.Int32@)
DO NOT USE! For internal usage only!
pClashes:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetCommandStatus(System.String@,System.String@,System.Boolean@)
DO NOT USE! For internal usage only!
TSCommand:
TSCommandParam:
Status:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetTrackEvent(System.String@,System.String@,System.String@)
DO NOT USE! For internal usage only!
category:
eventName:
eventContent:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetViewIdFromCameraChangedEvent(System.Int32@)
DO NOT USE! For internal usage only!
pViewId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetCommitData(Tekla.Structures.Internal.dotIdentifier_t@,System.Int32@,System.Int32@,System.Int32@,System.Int32@)
DO NOT USE! For internal usage only!
pId:
pObjectType:
pObjectSubType:
pCommitType:
pCommitSourceType:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetDotType(Tekla.Structures.ModelInternal.dotModelObject_t@)
DO NOT USE! For internal usage only!
pModelObject:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetPartMark(Tekla.Structures.ModelInternal.dotPartMark_t@)
DO NOT USE! For internal usage only!
pPartMark:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetCoordinateSystem(Tekla.Structures.ModelInternal.dotModelObject_t@,Tekla.Structures.Internal.dotCoordinateSystem_t@)
DO NOT USE! For internal usage only!
pModelObject:
pCoordinateSystem:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSetUserDefinedAssemblyCoordSys(Tekla.Structures.ModelInternal.dotAssembly_t@,Tekla.Structures.Internal.dotCoordinateSystem_t@)
DO NOT USE! For internal usage only!
pAssembly:
pCoordinateSystem:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportHasUserDefinedAssemblyCoordSys(Tekla.Structures.ModelInternal.dotAssembly_t@)
DO NOT USE! For internal usage only!
pAssembly:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportDeleteUserDefinedAssemblyCoordSys(Tekla.Structures.ModelInternal.dotAssembly_t@)
DO NOT USE! For internal usage only!
pAssembly:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetPlane(Tekla.Structures.ModelInternal.dotPlane_t@)
DO NOT USE! For internal usage only!
pPlane:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSetPlane(Tekla.Structures.ModelInternal.dotPlane_t@)
DO NOT USE! For internal usage only!
pPlane:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetTransformationPlane(Tekla.Structures.ModelInternal.dotTransformationPlane_t@)
DO NOT USE! For internal usage only!
pPlane:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSetTransformationPlane(Tekla.Structures.ModelInternal.dotTransformationPlane_t@)
DO NOT USE! For internal usage only!
pPlane:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetPointInputChangedEvent(System.Collections.Generic.List{Tekla.Structures.Model.ContourPoint}@)
DO NOT USE! For internal usage only!
pPoints:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportStartPolyLineInputGeometry(Tekla.Structures.ModelInternal.dotInputGeometry_t@,System.Collections.Generic.List{Tekla.Structures.Model.ContourPoint}@)
DO NOT USE! For internal usage only!
pClientID:
pPoints:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSetProperty(Tekla.Structures.ModelInternal.dotSetProperty_t@)
DO NOT USE! For internal usage only!
pProperty:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSetProperties(System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSetProperty_t})
DO NOT USE! For internal usage only!
Properties:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetAllReportProperties(System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotGetProperties_t}@)
DO NOT USE! For internal usage only!
pProperties:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetAllProperties(Tekla.Structures.ModelInternal.dotGetProperties_t@,System.Collections.Generic.List{System.Object}@,System.Collections.Generic.List{System.Object}@)
DO NOT USE! For internal usage only!
pProperties:
pNames:
pValues:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetProperties(Tekla.Structures.ModelInternal.dotGetProperties_t@)
DO NOT USE! For internal usage only!
pProperties:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetSetModelInfo(Tekla.Structures.ModelInternal.dotModelInfo_t@)
DO NOT USE! For internal usage only!
pInfo:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetProjectInfo(Tekla.Structures.ModelInternal.dotProjectInfo_t@)
DO NOT USE! For internal usage only!
pInfo:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyProjectInfo(Tekla.Structures.ModelInternal.dotProjectInfo_t@)
DO NOT USE! For internal usage only!
pInfo:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetFabricatorProject(Tekla.Structures.ModelInternal.dotFabricatorProject_t@)
DO NOT USE! For internal usage only!
pInfo:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyFabricatorProject(Tekla.Structures.ModelInternal.dotFabricatorProject_t@)
DO NOT USE! For internal usage only!
pInfo:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportInitializeComponentStacks
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportAddComponentAttributeToStack(Tekla.Structures.ModelInternal.dotComponentAttribute_t@)
DO NOT USE! For internal usage only!
pAttr:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportAddComponentInputToStack(Tekla.Structures.ModelInternal.dotComponentInputObject_t@)
DO NOT USE! For internal usage only!
pObj:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetComponentInput(Tekla.Structures.ModelInternal.dotComponentInputObject_t@)
DO NOT USE! For internal usage only!
pObj:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportLoadComponentAttributes(Tekla.Structures.ModelInternal.dotBaseComponent_t@)
DO NOT USE! For internal usage only!
pBaseComponent:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetComponentAttribute(Tekla.Structures.Internal.dotIdentifier_t@,Tekla.Structures.ModelInternal.dotComponentAttribute_t@)
DO NOT USE! For internal usage only!
pIdentifier:
pAttribute:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetNumberingUpToDate(Tekla.Structures.ModelInternal.dotNumberingQuery_t@)
DO NOT USE! For internal usage only!
pNumberingQuery:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetIsNumberingAllowed
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetSimilarNumberedObjects(Tekla.Structures.Internal.dotIdentifier_t@,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
pIdentifier:
pClientId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportNumGetObjectsTransformation(Tekla.Structures.Internal.dotIdentifier_t@,Tekla.Structures.Internal.dotIdentifier_t@,Tekla.Structures.Internal.dotCoordinateSystem_t@,Tekla.Structures.Internal.dotCoordinateSystem_t@)
DO NOT USE! For internal usage only!
object1Id: Object 1 id
object2Id: Object 2 id
cs1: Cs 1
cs2: Cs 2
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateReport(Tekla.Structures.ModelInternal.dotCreateReportFromModel_t@)
DO NOT USE! For internal usage only!
aReport:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportDisplayReport(System.String)
DO NOT USE! For internal usage only!
FileName:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.RegisterExcelDialogOpeningCallback(Tekla.Structures.Model.Internal.IReportingExcelDialogCallback)
DO NOT USE! For internal usage only!
dialogCallback:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportDisplayPrompt(System.String)
DO NOT USE! For internal usage only!
message:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.DisplayPrintReportDialog(System.String)
DO NOT USE! For internal usage only!
filePath:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetAttributeFiles(Tekla.Structures.ModelInternal.dotGetAttributeFiles_t@)
DO NOT USE! For internal usage only!
data: The data.
Returns: Number of files found.

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetAttributeFilesWithPrefix(Tekla.Structures.ModelInternal.dotGetAttributeFiles_t@)
DO NOT USE! For internal usage only!
data: The data.
Returns: Number of files found.

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportTryGetSubdirectoryFromFileName(Tekla.Structures.ModelInternal.dotTryGetSubdirectoryFromFileName_t@)
DO NOT USE! For internal usage only!
data: The data.
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSetAttributeFileSubdirectory(Tekla.Structures.ModelInternal.dotTryGetSubdirectoryFromFileName_t@)


Tekla.Structures.ModelInternal.CDelegateWrapper.ExportClearAttributeFileCache
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportWriteToSessionLog(System.String)
DO NOT USE! For internal usage only!
Message:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportWriteErrorToSessionLog(System.String)
DO NOT USE! For internal usage only!
message:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateNC(Tekla.Structures.ModelInternal.dotCreateNCFromModel_t@)
DO NOT USE! For internal usage only!
aNC:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateNCStructure(Tekla.Structures.ModelInternal.dotCreateNCFromModel_t@,Tekla.Structures.ModelInternal.dotDstvHeader@,Tekla.Structures.ModelInternal.dotDstvContours@,Tekla.Structures.ModelInternal.dotDstvHoles@,Tekla.Structures.ModelInternal.dotDstvMarks@,Tekla.Structures.ModelInternal.dotDstvBentLines@,Tekla.Structures.ModelInternal.dotDstvNumerations@)
DO NOT USE! For internal usage only!
aDotCreateNCFromModel:
pDstvHeader:
pDstvContours:
pDstvHoles:
pDstvMarks:
pDstvBentLines:
pDstvNumeration:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ImportExternalRefenceModel(Tekla.Structures.ModelInternal.dotExternalReferenceModel_t@)
DO NOT USE! For internal usage only!
aExternalReferenceModel:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ImportOverlayModelWithMetadata(Tekla.Structures.ModelInternal.dotExternalReferenceModel_t@)
DO NOT USE! For internal usage only!
aExternalReferenceModel:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.UpdateOverlayModel(Tekla.Structures.ModelInternal.dotExternalReferenceModel_t@)
DO NOT USE! For internal usage only!
aExternalReferenceModel:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.GetOverlayModel(System.String,Tekla.Structures.ModelInternal.dotExternalReferenceModel_t@)
DO NOT USE! For internal usage only!
path:
aExternalReferenceModel:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.GetImportedExternalReferenceModels(Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
pClientId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.RemoveExternalReferenceModel(System.String)
DO NOT USE! For internal usage only!
aPath:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ShowExternalReferenceModel(System.String,System.Int32)
DO NOT USE! For internal usage only!
aPath:
restrictToWorkArea:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.HideExternalReferenceModel(System.String)
DO NOT USE! For internal usage only!
aPath:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.SetExternalReferenceModelObjectVisibilities(System.String,System.Int32,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
aPath:
isVisible:
pClientId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.SelectObjectsInExternalReferenceModel(System.String,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
aPath:
pClientId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ZoomToExternalReferenceModel(System.String)
DO NOT USE! For internal usage only!
aPath:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ZoomViewToExternalReferenceModel(System.String,System.Int32)
DO NOT USE! For internal usage only!
aPath:
aViewId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.SetSelectedExternalReferenceModel(System.String)
DO NOT USE! For internal usage only!
aPath:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.GetExternalReferenceModelLayers(System.String,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
aPath:
pClientId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.SetExternalReferenceModelLayerVisibilities(System.String,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
aPath:
pClientId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.SetExternalReferenceModelObjectColoring(System.String,System.Double,System.Double,System.Double,System.Double,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
aPath:
red:
green:
blue:
alpha:
pClientId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ResetExternalReferenceModelColoring(System.String,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
aPath:
pClientId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.StartExternalReferenceModelChangeDetection(System.String,System.String,System.Int32,System.Int32,System.Int32,System.Int32,System.String,System.String)
DO NOT USE! For internal usage only!
aCurrenVersion:
aNewVersion:
changed:
inserted:
deleted:
unchanged:
comparisonSetTitle:
tolerancesTitle:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.StopExternalReferenceModelChangeDetection
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.GetExternalReferenceModelSelections(Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
pClientId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.GetOverlayModelSelectedEntityGuids(System.String,Tekla.Structures.ModelInternal.dotGuidList_t@)
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.BatchGetIdentifierByGUID(Tekla.Structures.ModelInternal.dotGuidList_t@,Tekla.Structures.ModelInternal.dotIntegerIdList_t@)
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.SelectObjectsFromModel(System.Int32,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
zoomTo:
pClientId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.LaunchExternalReferenceModelComparisonTolerancesDialog
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.LaunchExternalReferenceModelComparisonSetsDialog
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.GetExternalReferenceModelComparisonTolerances(Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.GetExternalReferenceModelComparisonSets(Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ChangeDetectionInitInProgress
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.GetHiddenExternalObjects(Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.GetOverlayModelHiddenEntityGuids(System.String,Tekla.Structures.ModelInternal.dotGuidList_t@)
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.CancelChangeDetectionInit
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.GetExternalReferenceModelPath(System.String,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal testing usage only!
aModelTsGuid:
pClientId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.GetExternalReferenceModelEntitiesCount(System.String)
DO NOT USE! For internal testing usage only!
aPath:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ConvertTsGuidToIfcGuid(System.String,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
aTsGuid:
pClientId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ConvertIfcGuidToTsGuid(System.String,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
aIfcGuid:
pClientId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetHiddenObjects(Tekla.Structures.ModelInternal.dotIntegerIdList_t@)
Retrieves the hidden objects
pGetHiddenObjects: The list of IDs to populate with hidden object IDs.
Returns: success.

Tekla.Structures.ModelInternal.CDelegateWrapper.GetOverlayModelEntityIdsFromIfcGuids(System.String,System.Collections.Generic.List{System.String},System.Collections.Generic.List{System.Int32}@)
DO NOT USE! For internal usage only!
Retrieves the runtime ids corresponding to the provided list of GUIDs for the specified overlay model.
path: The path to the overlay model
guids: The list of GUIDs
ids: The return list of ids
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.GetOverlayModelEntitiesIfcGuidsFromIds(System.String,System.Collections.Generic.List{System.Int32},System.Collections.Generic.List{System.String}@)
DO NOT USE! For internal usage only!
Retrieves the GUIDs corresponding to the provided list of runtime ids for the specified overlay model.
path: The path to the overlay model
ids: The list of ids
guids: The return list of GUIDs
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.GetReferenceModelObjectAttributes(System.Int32,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
refererenceModelObjectId:
pClientId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.GetOverlayModelTCIdAndVersionId(System.String,System.String@,System.String@)
DO NOT USE! For internal usage only!
Gets the Trimble Connect model identifier and version identifier from the reference model path.
path: The path of the imported overlay model
tcModelId: The returned TC model id
tcModelVersionId: The returned TC model version id
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.GetAllowedReferenceModelFileExtensions(Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
pClientId: Client id.
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.GetReferenceModelObjectFaces(System.Int32,Tekla.Structures.Internal.dotIdentifier_t@,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
maxFaceCount: The max face count.
pReferenceObjectIdentifier: The reference object identifier.
pClientId: Client id.
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.IsValidProfile(System.String)
DO NOT USE! For internal usage only!
aProfile: The profile.
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ImportBuildingHierarchyDataFromReferenceModel(System.String,System.Int32,System.Boolean)
DO NOT USE! For internal usage only!
aReferenceModelFile: The reference model file.
referenceModelId: The reference model id.
includeSpaces: True if spaces should be included in the import, False otherwise.
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ImportSemantic(System.String,System.String,Tekla.Structures.ModelInternal.dotClientId_t@,Tekla.Structures.ModelInternal.dotSemanticConversionSettings_t@,System.Double,System.Double,System.Double)
DO NOT USE! For internal usage only!
aPath:
aBasePointGuid:
pClientId:
pSettings:
OffsetX:
OffsetY:
OffsetZ:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModel(System.String,System.String,System.String,System.String,System.String,System.String,System.Int32,Tekla.Structures.ModelInternal.dotCreateTrimBimFromModel_t@,Tekla.Structures.Model.Internal.IProgressReportCallback)
DO NOT USE! For internal usage only!
aOutPath:
aBasePointType: base point type
aBasePointGuid:
aBasePointExportType:
aExportType:
aPropertiesPath:
selectedOnly:
info:
progressCb:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ConvertReferenceModels(Tekla.Structures.ModelInternal.dotSemanticConversionSettings_t@)
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.CreateExportObjectList(System.String,System.Boolean,Tekla.Structures.ModelInternal.dotExportSelectionInfo_t@)
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.SemanticTestAgainstModel(System.String,System.String,System.Boolean)
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateIFC(Tekla.Structures.ModelInternal.dotCreateIFCFromModel_t@)
DO NOT USE! For internal usage only!
aIFC:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ConvertIFC4toSemantic(System.String,System.String)
DO NOT USE! For internal usage only!
ifc4File:
outputPath:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.RunTqlQuery(Tekla.Structures.ModelInternal.dotUseTql_t@)
DO NOT USE! For internal usage only!
tql:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateRevit(Tekla.Structures.ModelInternal.dotCreateRevitFromModel_t@)
DO NOT USE! For internal usage only!
aRevit:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateDgn(Tekla.Structures.ModelInternal.dotCreateDgnFromModel_t@)
DO NOT USE! For internal usage only!
aDgn:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateDwg(Tekla.Structures.ModelInternal.dotCreateDwgFromModel_t@)
DO NOT USE! For internal usage only!
aDwg:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.GetDSTVCoordinateSystem(Tekla.Structures.Internal.dotIdentifier_t,Tekla.Structures.Internal.dotCoordinateSystem_t@)
DO NOT USE! For internal usage only!
PartId:
///
pCoordinateSystem:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportRunMacro(System.String)
DO NOT USE! For internal usage only!
FileName:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.IsMacroRunning
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSaveAsWebModel(Tekla.Structures.ModelInternal.dotSaveAsWebModel_t@)
DO NOT USE! For internal usage only!
pSaveAsWebModel:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportConvertPartToItem(System.Int32,System.Int32@)
DO NOT USE! For internal usage only!
partId: Part ID of the original part
newItemId: Newly created item ID
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateShapeFromGeometry(System.Int32,System.String@)
DO NOT USE! For internal usage only!
partId: Part ID of the original part
shapeName: Newly created shape name
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportManipulateObject(Tekla.Structures.ModelInternal.dotManipulateObject_t@)
DO NOT USE! For internal usage only!
pArgument:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportFreezeRebarSet(System.Int32,System.Boolean)
DO NOT USE! For internal usage only!
rebarSetId:
value:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportObjectsMatchToFilter(Tekla.Structures.ModelInternal.dotClientId_t@,System.String)
DO NOT USE! For internal usage only!
pClientId:
FileName:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportObjectMatchesToFilter(Tekla.Structures.Internal.dotIdentifier_t@,System.String)
DO NOT USE! For internal usage only!
pObjectId:
FileName:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportInitFilterCache
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportClearFilterCache
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportProgressBarOperation(Tekla.Structures.ModelInternal.dotProgressBar_t@)
DO NOT USE! For internal usage only!
pProgressBar:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportDrawTemporaryText(Tekla.Structures.ModelInternal.dotDrawText_t@)
DO NOT USE! For internal usage only!
pArgument:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportDrawTemporaryTextToView(Tekla.Structures.ModelInternal.dotDrawText_t@,System.Int32)
DO NOT USE! For internal usage only!
pArgument:
ViewId: The View Id, 0 for current view
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportDrawTemporaryPolyLine(Tekla.Structures.ModelInternal.dotDrawPolyLine_t@)
DO NOT USE! For internal usage only!
pArgument:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportDrawTemporaryPolyLineWithId(Tekla.Structures.ModelInternal.dotGraphicPolyLine_t@)
DO NOT USE! For internal usage only!
pArgument:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportRemoveTemporaryGraphicsObjects(Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
pArgument:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportDrawTemporaryPolygonSurface(Tekla.Structures.ModelInternal.dotDrawPolygonSurface_t@)
DO NOT USE! For internal usage only!
pArgument:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSetObjectPhase(Tekla.Structures.ModelInternal.dotPhase_t@)
DO NOT USE! For internal usage only!
pArgument:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSetGetPhaseProperty(Tekla.Structures.ModelInternal.dotSetGetProperty_t@)
DO NOT USE! For internal usage only!
pArgument:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetObjectPhase(Tekla.Structures.ModelInternal.dotPhase_t@)
DO NOT USE! For internal usage only!
pArgument:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetObjectLastModified(Tekla.Structures.Internal.dotIdentifier_t@,System.Int32@,System.Boolean@)
DO NOT USE! For internal usage only!
pIdentifier:
pTime:
pLocallyModified:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetObjectNumberedStatus(Tekla.Structures.Internal.dotIdentifier_t@,System.Boolean@)
DO NOT USE! For internal usage only!
pIdentifier:
pLocallyModified:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetPhaseNumbers(Tekla.Structures.ModelInternal.dotPhaseNumbers_t@)
DO NOT USE! For internal usage only!
pArgument:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetModificationStamp(Tekla.Structures.ModelInternal.dotModificationStamp_t@)
DO NOT USE! For internal usage only!
pModStmp:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetModificationStampGuid(System.String@)
DO NOT USE! For internal usage only!
pModStmp:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetWriteOutStampGuid(System.String@)
DO NOT USE! For internal usage only!
pModStmp:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportInsertView(System.Int32,System.Int32,Tekla.Structures.ModelInternal.dotView_t@)
DO NOT USE! For internal usage only!
OpenView:
UseAppliedValues:
pDotView:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportInsertViewByStandardFile(System.String,Tekla.Structures.ModelInternal.dotView_t@)
DO NOT USE! For internal usage only!
fileName:
pDotView:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyView(Tekla.Structures.ModelInternal.dotView_t@)
DO NOT USE! For internal usage only!
pDotView:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectView(Tekla.Structures.ModelInternal.dotView_t@)
DO NOT USE! For internal usage only!
pDotView:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetViews(Tekla.Structures.ModelInternal.dotViewSelector_t@)
DO NOT USE! For internal usage only!
pViews:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetCurrentView(Tekla.Structures.ModelInternal.dotView_t@)
DO NOT USE! For internal usage only!
pDotView:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetActiveView(Tekla.Structures.ModelInternal.dotView_t@)
DO NOT USE! For internal usage only!
pDotView:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSetActiveView(Tekla.Structures.ModelInternal.dotView_t@)
DO NOT USE! For internal usage only!
pDotView:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetViewPointFromCurrentView(Tekla.Structures.Internal.dotPoint_t@)
DO NOT USE! For internal usage only!
pViewPoint:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.SetViewVisibilityFilterValue(System.Int32,System.String)
DO NOT USE! For internal usage only!
viewId: The model view id.
viewVisibilityFilterValue: The view visibility filter value.
Returns: True if the view visibility filter value was succesfully set.

Tekla.Structures.ModelInternal.CDelegateWrapper.GetViewVisibilityFilterValue(System.Int32,System.String@)
DO NOT USE! For internal usage only!
viewId: The view id.
viewVisibilityFilterValue: The view visibility filter value.
Returns: True if the view visibility filter value was succesfully returned.

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSetRepresentation(System.String)
DO NOT USE! For internal usage only!
pViews:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSetViewPartRepresentationState(System.Int32)
DO NOT USE! For internal usage only!
RepresentationState:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportViewHideUnselected(System.Boolean,System.Boolean)
DO NOT USE! For internal usage only!
HideCompletely:
DrawAsStick:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetClipPlanes(Tekla.Structures.ModelInternal.dotView_t@,Tekla.Structures.ModelInternal.dotGetClipPlanes_t@)
DO NOT USE! For internal usage only!
pView:
pGetClipPlanes:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetObjectExtremaBoxData(Tekla.Structures.ModelInternal.dotGetObjectExtremaBoxData_t@)
DO NOT USE! For internal usage only!
pGetObjectExtremaBoxData:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateClipPlane(Tekla.Structures.ModelInternal.dotView_t@,Tekla.Structures.ModelInternal.dotClipPlane_t@)
DO NOT USE! For internal usage only!
pView:
pClipPlane:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportDeleteClipPlane(Tekla.Structures.ModelInternal.dotView_t@,Tekla.Structures.ModelInternal.dotClipPlane_t@)
DO NOT USE! For internal usage only!
pView:
pClipPlane:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyClipPlane(Tekla.Structures.ModelInternal.dotView_t@,Tekla.Structures.ModelInternal.dotClipPlane_t@)
DO NOT USE! For internal usage only!
pView:
pClipPlane:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateClipBox(Tekla.Structures.ModelInternal.dotView_t@,Tekla.Structures.ModelInternal.dotClipBox_t@)
DO NOT USE! For internal usage only!
pView:
pClipBox:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportDeleteClipBox(Tekla.Structures.ModelInternal.dotView_t@,Tekla.Structures.ModelInternal.dotClipBox_t@)
DO NOT USE! For internal usage only!
pView:
pClipBox:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyClipBox(Tekla.Structures.ModelInternal.dotView_t@,Tekla.Structures.ModelInternal.dotClipBox_t@)
DO NOT USE! For internal usage only!
pView:
pClipBox:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSetTransformPlaneAsWorkFloor
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSetTemporaryState(Tekla.Structures.Internal.dotIdentifier_t@,Tekla.Structures.ModelInternal.dotTemporaryStatesEnum@)
DO NOT USE! For internal usage only!
pObjectId:
pNewState:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSetTemporaryStates(Tekla.Structures.ModelInternal.dotSetTemporaryStates_t@)
DO NOT USE! For internal usage only!
pSetTemporaryStates:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSetTemporaryStates_FAST(System.Collections.Generic.List{Tekla.Structures.Identifier}@,Tekla.Structures.ModelInternal.dotSetTemporaryStates_t@)
DO NOT USE! For internal usage only!
pObjects:
pSetTemporaryStates:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSetTemporaryColor(Tekla.Structures.Internal.dotIdentifier_t@,Tekla.Structures.ModelInternal.dotColor_t@)
DO NOT USE! For internal usage only!
pObjectId:
pNewColor:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetTemporaryColor(Tekla.Structures.Internal.dotIdentifier_t@,Tekla.Structures.ModelInternal.dotColor_t@)
DO NOT USE! For internal usage only!
pObjectId:
pNewColor:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSetTemporaryColors(Tekla.Structures.ModelInternal.dotSetTemporaryColors_t@)
DO NOT USE! For internal usage only!
pSetTemporaryColors:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetTemporaryColors(Tekla.Structures.ModelInternal.dotGetTemporaryColors_t@)
DO NOT USE! For internal usage only!
pGetTemporaryColors:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSetTemporaryVisibility(Tekla.Structures.ModelInternal.dotSetTemporaryStates_t@)
DO NOT USE! For internal usage only!
pSetTemporaryState:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportResetTemporaryVisibility(Tekla.Structures.ModelInternal.dotSetTemporaryStates_t@)
DO NOT USE! For internal usage only!
pSetTemporaryState:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSetTemporaryColors_FAST(System.Collections.Generic.List{Tekla.Structures.Identifier}@,Tekla.Structures.ModelInternal.dotSetTemporaryColors_t@)
DO NOT USE! For internal usage only!
pObjects:
pSetTemporaryColors:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportClearTemporaryState(Tekla.Structures.Internal.dotIdentifier_t@)
DO NOT USE! For internal usage only!
pObjectId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportClearTemporaryColor(Tekla.Structures.Internal.dotIdentifier_t@)
DO NOT USE! For internal usage only!
pObjectId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportClearAllTemporaryStates
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportUnhideParts
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetViewCamera(Tekla.Structures.ModelInternal.dotView_t@,Tekla.Structures.ModelInternal.dotCamera_t@)
DO NOT USE! For internal usage only!
pView:
pCamera:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSetViewCamera(Tekla.Structures.ModelInternal.dotView_t@,Tekla.Structures.ModelInternal.dotCamera_t@)
DO NOT USE! For internal usage only!
pView:
pCamera:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportDasStartCommand(System.String,System.String)
DO NOT USE! For internal usage only!
CommandName:
Parameter:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportDasStartAction(System.String,System.String)
DO NOT USE! For internal usage only!
ActionName:
Parameter:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSaveOperation(Tekla.Structures.ModelInternal.dotSaveOperation_t@)
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportUndoOperation(Tekla.Structures.ModelInternal.dotUndoOperation_t@)
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetDataBaseVersionInfoFromModel(Tekla.Structures.ModelInternal.dotModelInfo_t@)
DO NOT USE! For internal usage only!
pInfo:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportBhMoveObjects(Tekla.Structures.ModelInternal.dotClientId_t@,Tekla.Structures.Internal.dotPoint_t@)
DO NOT USE! For internal usage only!
clientId: Client id.
moveVector: The move vector.
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateNewModel(Tekla.Structures.ModelInternal.dotModelInfo_t@)
DO NOT USE! For internal usage only!
pInfo:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSharingOperation(Tekla.Structures.ModelInternal.dotSharingOperation_t@)
DO NOT USE! For internal usage only!
pOperation:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModel2Operation(Tekla.Structures.ModelInternal.dotModel2Operation_t@)
DO NOT USE! For internal usage only!
pOperation:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportExternalDrawOperation(Tekla.Structures.ModelInternal.dotExternalDrawOperation_t@)
DO NOT USE! For internal usage only!
pOperation:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportTranslateLabel(Tekla.Structures.ModelInternal.dotTranslateLabel_t@)
DO NOT USE! For internal usage only!
pTranslateLabel:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportIntListHandler(Tekla.Structures.ModelInternal.dotnetIntList_t@)
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.CDelegateWrapper.ImportIntListHandler(Tekla.Structures.ModelInternal.dotnetIntList_t@)
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportDoubleListHandler(Tekla.Structures.ModelInternal.dotnetDoubleList_t@)
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.CDelegateWrapper.ImportDoubleListHandler(Tekla.Structures.ModelInternal.dotnetDoubleList_t@)
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportStringListHandler(Tekla.Structures.ModelInternal.dotnetStringList_t@)
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.CDelegateWrapper.ImportStringListHandler(Tekla.Structures.ModelInternal.dotnetStringList_t@)
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportPathListHandler(Tekla.Structures.ModelInternal.dotnetPathList_t@)
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.CDelegateWrapper.ImportPathListHandler(Tekla.Structures.ModelInternal.dotnetPathList_t@)
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportPointListHandler(Tekla.Structures.ModelInternal.dotnetPointList_t@)
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.CDelegateWrapper.ImportPointListHandler(Tekla.Structures.ModelInternal.dotnetPointList_t@)
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportEdgeListHandler(Tekla.Structures.ModelInternal.dotnetEdgeList_t@)
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.CDelegateWrapper.ImportEdgeListHandler(Tekla.Structures.ModelInternal.dotnetEdgeList_t@)
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportValidatePolymesh(System.Int32,Tekla.Structures.ModelInternal.dotPolymesh_t@,Tekla.Structures.ModelInternal.dotPolymeshValidateInvalidInfo_t@)
DO NOT USE! For internal usage only!
checkCriteria: The checking criteria.
polymeshToValidate: The polymesh to be checked.
invalidInfo: The checking results.
Returns: True if valid, false if error found

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetSolidBrep(Tekla.Structures.ModelInternal.dotPolymesh_t@,Tekla.Structures.ModelInternal.dotPolymesh_t@)
DO NOT USE! For internal usage only!
polymeshToClean: The polymesh to be cleaned.
polymeshCleaned: The cleaned polymesh.
Returns: True if the polymesh can be solid, otherwise false.

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportAllowAutoSave(System.Boolean)
DO NOT USE! For internal usage only!
allowed:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportChangeManagerAllowSave(System.Boolean)
DO NOT USE! For internal usage only!
SaveFlag:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportChangeManagerAllowNumbering(System.Boolean)
DO NOT USE! For internal usage only!
NumberingFlag:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportShadowArea(Tekla.Structures.ModelInternal.dotAreaPolygons_t@)
DO NOT USE! For internal usage only!
pArgument:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportShadowAreaComplement(Tekla.Structures.ModelInternal.dotAreaPolygons_t@)
DO NOT USE! For internal usage only!
pArgument:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetColorRepresentationForObject(Tekla.Structures.Internal.dotIdentifier_t@,Tekla.Structures.ModelInternal.dotColor_t@)
DO NOT USE! For internal usage only!
pIdentifier:
pColor:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetReferenceModelObjectByExternalGuid(System.Int32,Tekla.Structures.Internal.dotIdentifier_t@)
DO NOT USE! For internal usage only!
referenceModelId: The reference model id.
externalGuid: The external guid.
Returns: The System.Int32.

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCheckObject1ModifiedAfterObject2(Tekla.Structures.Internal.dotIdentifier_t@,Tekla.Structures.Internal.dotIdentifier_t@)
DO NOT USE! For internal usage only!
object1: The model object 1 id.
object2: The model object 2 id.
Returns: The System.Int32.

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportObjectIncludedToCopyOrMoveOperation(Tekla.Structures.Internal.dotIdentifier_t@)
DO NOT USE! For internal usage only!
object1: The object guid.
Returns: The System.Int32.

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportObjectsIncludedToCopyOrMoveOperation(Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
object1: The client id.
Returns: The System.Int32.

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSetAdvancedOption(Tekla.Structures.Internal.dotGetAdvancedOption_t@)
pArgument:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetBeamPositioningBox(Tekla.Structures.ModelInternal.dotBeamPositioningBox_t@)
pBeamPositioningBox:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.GrdrShowPreviewDrawing(System.Int32)
DrawingId: id
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetStringPropertyFromDatabase(Tekla.Structures.ModelInternal.dotStringProperty_t@,System.Collections.Generic.List{System.String}@)
DO NOT USE! For internal usage only!
pProperty:
stringValues:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSetStringPropertyToDatabase(Tekla.Structures.ModelInternal.dotStringProperty_t@,System.Collections.Generic.List{System.String}@)
DO NOT USE! For internal usage only!
pProperty:
stringValues:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetSnapshotFromDatabase(Tekla.Structures.ModelInternal.dotEnumerator_t@,System.Boolean)
DO NOT USE! For internal usage only!
Enumerator:
SelectInstances:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportFetchFromDatabase(System.Collections.Generic.List{System.String}@,System.Boolean)
DO NOT USE! For internal usage only!
Guids:
SelectInstances:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportFetchFromDatabaseWithIds(System.Collections.Generic.List{System.Int32}@,System.Boolean)
DO NOT USE! For internal usage only!
Ids:
SelectInstances:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetSolidSerialized(Tekla.Structures.ModelInternal.dotSolid_t@,System.Collections.Generic.List{System.Collections.Generic.List{System.Collections.Generic.List{Tekla.Structures.Internal.dotPoint_t}}}@,System.Collections.Generic.List{Tekla.Structures.Internal.dotPoint_t}@,System.Collections.Generic.List{System.Int32}@,System.Collections.Generic.List{System.Int32}@)
DO NOT USE! For internal usage only!
dotSolid:
serializedFaceList:
serializedVectorList:
serializedShellIndexList:
serializedFaceOriginIdList:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetSolidMerged(Tekla.Structures.ModelInternal.dotSolid_t@,Tekla.Structures.ModelInternal.dotPolymesh_t@)
DO NOT USE! For internal usage only!
dotSolid: The dot solid.
polymeshes: The polymeshes.
Returns:
Result of task

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetCutSolidSerialized(Tekla.Structures.ModelInternal.dotSolid_t@,Tekla.Structures.ModelInternal.dotSolid_t@,System.Collections.Generic.List{System.Collections.Generic.List{System.Collections.Generic.List{Tekla.Structures.Internal.dotPoint_t}}}@,System.Collections.Generic.List{Tekla.Structures.Internal.dotPoint_t}@,System.Collections.Generic.List{System.Int32}@,System.Collections.Generic.List{System.Int32}@,System.Collections.Generic.List{Tekla.Structures.Internal.dotPoint_t}@,System.Collections.Generic.List{System.Int32}@,System.Collections.Generic.List{System.Int32}@)
DO NOT USE! For internal usage only!
dotSolid1:
dotSolid2:
serializedFaceList:
serializedVectorList:
serializedFaceOriginPartIdList:
serializedShellIndexList:
serializedEdgeVertexList:
serializedEdgeTypeList:
serializedEdgeShellIndexList:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateRebarSet(Tekla.Structures.ModelInternal.dotRebarSet_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotLegFace_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotGuideline_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingZone_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingElement_t}@)


Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyRebarSet(Tekla.Structures.ModelInternal.dotRebarSet_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotLegFace_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotGuideline_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingZone_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingElement_t}@)


Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectRebarSet(Tekla.Structures.ModelInternal.dotRebarSet_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotLegFace_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotGuideline_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingZone_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingElement_t}@)


Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateRebarSetAddition(Tekla.Structures.ModelInternal.dotRebarSetAddition_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotLegFace_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@)


Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyRebarSetAddition(Tekla.Structures.ModelInternal.dotRebarSetAddition_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotLegFace_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@)


Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectRebarSetAddition(Tekla.Structures.ModelInternal.dotRebarSetAddition_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotLegFace_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@)


Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetSetModstamp(Tekla.Structures.ModelInternal.dotModStamp_t@)
DO NOT USE! For internal usage only!
ModStampData:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModStampCompare(Tekla.Structures.ModelInternal.dotModStampCompare_t@)
DO NOT USE! For internal usage only!
ModStampCompare:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateRebarPropertyStrip(Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingElement_t}@)
DO NOT USE! For internal usage only.
pStrip: The strip.
dotSpacingElementList: The spacing element list.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyRebarPropertyStrip(Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingElement_t}@)
DO NOT USE! For internal usage only.
pStrip: The strip.
dotSpacingElementList: The spacing element list.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectRebarPropertyStrip(Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingElement_t}@)
DO NOT USE! For internal usage only.
pStrip: The strip.
dotSpacingElementList: The spacing element list.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateRebarEndDetailStrip(Tekla.Structures.ModelInternal.dotRebarEndDetailStrip_t@)
DO NOT USE! For internal usage only.
pStrip: The strip.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyRebarEndDetailStrip(Tekla.Structures.ModelInternal.dotRebarEndDetailStrip_t@)
DO NOT USE! For internal usage only.
pStrip: The strip.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectRebarEndDetailStrip(Tekla.Structures.ModelInternal.dotRebarEndDetailStrip_t@)
DO NOT USE! For internal usage only.
pStrip: The strip.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateRebarSplitter(Tekla.Structures.ModelInternal.dotRebarSplitter_t@)
DO NOT USE! For internal usage only.
pStrip: The strip.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyRebarSplitter(Tekla.Structures.ModelInternal.dotRebarSplitter_t@)
DO NOT USE! For internal usage only.
pStrip: The strip.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectRebarSplitter(Tekla.Structures.ModelInternal.dotRebarSplitter_t@)
DO NOT USE! For internal usage only.
pStrip: The strip.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportChangeLegFaceLayer(System.Collections.Generic.List{System.Int32}@,System.Int32,System.Int32)
DO NOT USE! For internal usage only.
rebarSetId:
dotLegFaces:
change:
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSingleRebarGetRebarSet(System.Int32)
DO NOT USE! For internal usage only.
singleRebarId: The single rebar ID.
Returns: The rebar set ID if successful; otherwise 0.

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetShapeMetadata(System.String,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
clientId: ClientId for this session
guid: Shape GUID///
Returns: Returns 1 if the operation was fully successful, otherwise 0.

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateSurfaceObject(Tekla.Structures.ModelInternal.dotSurfaceObject_t@)
DO NOT USE! For internal usage only!
pSurfaceObject: The surface object.
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectSurfaceObject(Tekla.Structures.ModelInternal.dotSurfaceObject_t@)
DO NOT USE! For internal usage only!
pSurfaceObject: The surface object.
Returns: returns status of operation.

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifySurfaceObject(Tekla.Structures.ModelInternal.dotSurfaceObject_t@)
DO NOT USE! For internal usage only!
pSurfaceObject: The surface object.
Returns: returns result of export.

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateLegSurfaceObject(Tekla.Structures.ModelInternal.dotLegSurfaceObject_t@)
DO NOT USE! For internal usage only!
pSurfaceObject: The surface object.
Returns: Returns result of export.

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectLegSurfaceObject(Tekla.Structures.ModelInternal.dotLegSurfaceObject_t@)
DO NOT USE! For internal usage only!
pSurfaceObject: The surface object.
Returns: Returns result of export.

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModifyLegSurfaceObject(Tekla.Structures.ModelInternal.dotLegSurfaceObject_t@)
DO NOT USE! For internal usage only!
pSurfaceObject: The surface object.
Returns: Returns result of export.

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateSurfaceByFace(Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,System.Int32)
DO NOT USE! For internal usage only!
hitPoint:
faceNormal:
id:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateSurfaceByFaceAndAttrib(Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,System.Int32,System.String,System.String)
DO NOT USE! For internal usage only!
hitPoint:
faceNormal:
id:
name:
surfaceClass:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateLegSurfaceByFace(Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,System.Int32,System.Int32)
DO NOT USE! For internal usage only!
hitPoint: The hit point.
faceNormal: The face normal.
id: The object ID.
rebarSetId: The parent rebar set ID.
Returns: Returns result of export.

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetAssociateSurfaces(System.Int32)
DO NOT USE! For internal usage only!
id:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetParentObject(System.Int32)
DO NOT USE! For internal usage only!
surfaceId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetAssemblyId(System.Int32,System.Int32@)
DO NOT USE! For internal usage only!
identifier:
rootAssemblyIdentifier:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetObjectAssemblyPrimary(System.Int32,System.Int32@)
DO NOT USE! For internal usage only!
objectId:
objectAssemblyPrimaryId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetSurfaceGeometryType(System.Int32)
DO NOT USE! For internal usage only!
surfaceId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSelectConversionLink(Tekla.Structures.ModelInternal.dotConversionLink_t@)


Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateConversionLink(Tekla.Structures.ModelInternal.dotConversionLink_t@)


Tekla.Structures.ModelInternal.CDelegateWrapper.ExportDeleteConversionLink(Tekla.Structures.ModelInternal.dotConversionLink_t@)


Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetDatabaseVersion(System.Int32@)


Tekla.Structures.ModelInternal.CDelegateWrapper.ExportRunDataRetrieverCommand(System.String)


Tekla.Structures.ModelInternal.CDelegateWrapper.ExportFingerprint(Tekla.Structures.ModelInternal.dotPolymesh_t@,System.String@)


Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCompareFingerprints(System.String,System.String)


Tekla.Structures.ModelInternal.CDelegateWrapper.ExportMarkObjectModifiedForOrganizer(System.Int32)


Tekla.Structures.ModelInternal.CDelegateWrapper.ExportAddToPourUnit(Tekla.Structures.ModelInternal.dotPourUnit_t@,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
inputPour:
clientId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportRemoveFromPourUnit(Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
clientId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCalculatePourUnits
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportAppendMetadata(System.String,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
guid: Shape GUID
clientId: ClientId for this session
Returns: Returns 1 if the operation was fully successful, otherwise 0

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportAddShapeMetadata(System.String,System.String,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
guid: Shape GUID
key: Metadata key
clientId: ClientId for this session
Returns: Returns 1 if the operation was fully successful, otherwise 0

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportUpdateShapeMetadata(System.String,System.String,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
guid: Shape GUID
key: Metadata key
clientId: ClientId for this session
Returns: Returns 1 if the operation was fully successful, otherwise 0

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetShapeMetadataVal(System.String,System.String,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
guid: Shape GUID
key: Metadata key
clientId: ClientId for this session
Returns: Returns 1 if the operation was fully successful, otherwise 0

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetShapeAllMetadataKeys(System.String,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
guid: Shape GUID
clientId: ClientId for this session
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportDeleteMetadata(System.String,System.String)
DO NOT USE! For internal usage only!
guid: Shape GUID
key:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetHandlePoints(Tekla.Structures.ModelInternal.dotClientId_t,System.String,System.Collections.Generic.List{Tekla.Structures.Geometry3d.Point}@)
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSetHandlePoints(Tekla.Structures.ModelInternal.dotClientId_t@,System.String)
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportRenderGraphicContainer(System.Int32,Tekla.Structures.ModelInternal.dotGraphicObjectContainer_t@,System.Collections.Generic.List{Tekla.Structures.Geometry3d.Point}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.GraphicLine}@,System.Collections.Generic.List{Tekla.Structures.Model.UI.GraphicPolyLine}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.GraphicFace}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.GraphicText}@)
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportDeleteGraphicObjectContainer(Tekla.Structures.ModelInternal.dotGraphicObjectContainer_t@)
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportDeleteAllGraphicObjectContainers(Tekla.Structures.ModelInternal.dotGraphicObjectContainer_t@)
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetPartContour(System.Int32,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotPolycurvePoint_t}@)
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModelTestingFeaturesHandler(Tekla.Structures.ModelInternal.dotModelTestingFeaturesHandler_t@)
pHandler:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModelFeaturesHandler(Tekla.Structures.ModelInternal.dotModelFeaturesHandler_t@)


Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetPartExtrema(System.Int32,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@)


Tekla.Structures.ModelInternal.CDelegateWrapper.ExportBatchEditorHandler(Tekla.Structures.ModelInternal.dotBatchEditorHandler_t@)
pHandler:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportFabricationHandler(Tekla.Structures.ModelInternal.dotFabricationHandler_t@)


Tekla.Structures.ModelInternal.CDelegateWrapper.ExportSetPrintingController(Tekla.Structures.ModelInternal.IPrintingController)
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetPrintingController(Tekla.Structures.ModelInternal.IPrintingController@)
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCalculateContourPolycurve(System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotPolycurvePoint_t}@)
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetObjectAttribute(System.Int32,System.String,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetAvailableCustomPropertyNames(Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.AutomatedTesting_BroadcastMessage(System.String)
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.WriteTrbCreatedEvent
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.GetAvailableProfiles(Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
pClientId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.GetAvailableMaterials(System.String,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
profileName:
pClientId:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportCreateViewSnapshotToFile(System.String,System.Int32,Tekla.Structures.Model.UI.SnapshotSettings,System.Boolean)


Tekla.Structures.ModelInternal.CDelegateWrapper.StartLiveSharing(Tekla.Structures.Model.Internal.IChangeSetCreatedCallback,System.Guid,Tekla.Structures.Model.Internal.LiveSharingModelType,System.Int32)


Tekla.Structures.ModelInternal.CDelegateWrapper.GetPendingChangeSets(System.String,Tekla.Structures.Model.Internal.LiveSharingModelType,System.Int32)


Tekla.Structures.ModelInternal.CDelegateWrapper.StopLiveSharing(System.Guid)


Tekla.Structures.ModelInternal.CDelegateWrapper.CreateBaseline(System.String,Tekla.Structures.Model.Internal.LiveSharingModelType,System.Int32,Tekla.Structures.Model.Internal.ICancellableProgressReportCallback)


Tekla.Structures.ModelInternal.CDelegateWrapper.AddChangeSet(System.String,System.String,System.Byte[])


Tekla.Structures.ModelInternal.CDelegateWrapper.RemoveChangeSet(System.String)


Tekla.Structures.ModelInternal.CDelegateWrapper.GetEventTimeGuid(System.String)


Tekla.Structures.ModelInternal.CDelegateWrapper.EventsDbTimeOrdered(System.String,System.String)


Tekla.Structures.ModelInternal.CDelegateWrapper.WriteEventToDatabase(System.String)


Tekla.Structures.ModelInternal.CDelegateWrapper.RenameEvent(System.String,System.String)


Tekla.Structures.ModelInternal.CDelegateWrapper.HighlightSelectedBoltParts(System.Int32)


Tekla.Structures.ModelInternal.CDelegateWrapper.HighlightConnectedObjects(System.Collections.Generic.List{System.Int32}@)


Tekla.Structures.ModelInternal.CDelegateWrapper.UnhighlightConnectedObjects


Tekla.Structures.ModelInternal.CDelegateWrapper.GetTSLanguageCultureString


Tekla.Structures.ModelInternal.CDelegateWrapper.GetNumberingTemporaryRecordList


Tekla.Structures.ModelInternal.CDelegateWrapper.GetNumberingSettings(Tekla.Structures.ModelInternal.dotNumberingSettingsType_t@)


Tekla.Structures.ModelInternal.CDelegateWrapper.GetReportProperty(System.String,System.Int32,Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.CDelegateWrapper.RegisterAssertCallback(Tekla.Structures.Model.Internal.IAssertEventCallback)


Tekla.Structures.ModelInternal.CDelegateWrapper.RunNumberingCommandWithPreview(System.Boolean,System.Boolean)


Tekla.Structures.ModelInternal.CDelegateWrapper.AcceptNumberingResults


Tekla.Structures.ModelInternal.CDelegateWrapper.RejectNumberingResults


Tekla.Structures.ModelInternal.CDelegateWrapper.CheckABMNumbering(System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotCheckABMResult_t}@)


Tekla.Structures.ModelInternal.CDelegateWrapper.GetDeletedSubmittedPartsCount(System.String)


Tekla.Structures.ModelInternal.CDelegateWrapper.ProcessABMNumbering(System.Collections.Generic.List{System.Int32})


Tekla.Structures.ModelInternal.CDelegateWrapper.UnnumberProcurementParts(System.Collections.Generic.List{System.Int32})


Tekla.Structures.ModelInternal.CDelegateWrapper.SendCustomPartsToABMNumbering(System.Collections.Generic.List{System.Int32},System.String,System.String@,System.String@)


Tekla.Structures.ModelInternal.CDelegateWrapper.GetAbmSettings(Tekla.Structures.ModelInternal.dotAbmSettings_t@)


Tekla.Structures.ModelInternal.CDelegateWrapper.SetAbmSettings(Tekla.Structures.ModelInternal.dotAbmSettings_t@)


Tekla.Structures.ModelInternal.CDelegateWrapper.ClearOldFabricatorSettings


Tekla.Structures.ModelInternal.CDelegateWrapper.IsValidFabricatorProfile(System.String)


Tekla.Structures.ModelInternal.CDelegateWrapper.GetNormalizedPlateProfileName(System.Int32,System.Int32)


Tekla.Structures.ModelInternal.CDelegateWrapper.IsValidFabricatorMaterial(System.String,System.String)


Tekla.Structures.ModelInternal.CDelegateWrapper.IsValidFabricatorFinish(System.String)


Tekla.Structures.ModelInternal.CDelegateWrapper.IsProfileAccepted(System.String)


Tekla.Structures.ModelInternal.CDelegateWrapper.IsMaterialAccepted(System.String,System.String)


Tekla.Structures.ModelInternal.CDelegateWrapper.IsFinishAccepted(System.String)


Tekla.Structures.ModelInternal.CDelegateWrapper.AddAcceptedProfile(System.String)


Tekla.Structures.ModelInternal.CDelegateWrapper.AddAcceptedMaterial(System.String,System.String)


Tekla.Structures.ModelInternal.CDelegateWrapper.AddAcceptedFinish(System.String)


Tekla.Structures.ModelInternal.CDelegateWrapper.DeleteAcceptedProfile(System.String)


Tekla.Structures.ModelInternal.CDelegateWrapper.DeleteAcceptedMaterial(System.String,System.String)


Tekla.Structures.ModelInternal.CDelegateWrapper.DeleteAcceptedFinish(System.String)


Tekla.Structures.ModelInternal.CDelegateWrapper.ClearVirtualBarCache


Tekla.Structures.ModelInternal.CDelegateWrapper.ShowAssembliesHierarchy(System.Collections.Generic.List{System.Int32})


Tekla.Structures.ModelInternal.CDelegateWrapper.GetMousePositionInModelCoordinates(Tekla.Structures.Internal.dotPoint_t@)
